This is the MICRO data with yearly seasonality

In [155]:
import pandas as pd
from pathlib import Path

micro_data = pd.read_csv("/Users/bogdansandoiu/Documents/Neural Networks/Stocks Forecasting/Stocks-forecasting/data/raw/Micro_yearly.csv", sep=';', decimal=',', encoding='utf-8-sig')
micro_data.head()

,Series,N,NF,Category,Starting Year,Unnamed: 5,1,2,3,4,...,11,12,13,14,15,16,17,18,19,20
0,N 1,20,6,MICRO,1975,1,940.66,1084.86,1244.98,1445.02,...,3360.27,3807.63,4387.88,4936.99,5379.75,6158.68,6876.58,7851.91,8407.84,9156.01
1,N 2,20,6,MICRO,1975,1,1991.05,2306.40,2604.00,2992.30,...,5384.40,3656.20,4034.80,4230.00,4793.20,5602.00,5065.00,5056.00,5067.20,5209.60
2,N 3,20,6,MICRO,1975,1,1461.57,1692.50,2193.82,2459.68,...,4344.60,2897.40,3256.40,3525.20,3070.20,3601.60,3407.40,3500.60,3437.80,3007.00
3,N 4,20,6,MICRO,1975,1,744.54,1105.16,1417.40,1838.04,...,3808.64,3114.42,3847.20,4632.30,4656.00,5228.52,5656.72,5077.02,5403.40,5009.52
4,N 5,20,6,MICRO,1975,1,4977.18,5248.00,5370.00,6184.89,...,5117.64,4332.90,4620.50,5488.80,5250.90,4899.20,4317.90,4007.90,4323.40,4819.40

Drop useless columns

In [156]:
micro_data = micro_data.drop(columns=["Category", "Unnamed: 5"])
micro_data.head()

,Series,N,NF,Starting Year,1,2,3,4,5,6,...,11,12,13,14,15,16,17,18,19,20
0,N 1,20,6,1975,940.66,1084.86,1244.98,1445.02,1683.17,2038.15,...,3360.27,3807.63,4387.88,4936.99,5379.75,6158.68,6876.58,7851.91,8407.84,9156.01
1,N 2,20,6,1975,1991.05,2306.40,2604.00,2992.30,3722.08,5226.62,...,5384.40,3656.20,4034.80,4230.00,4793.20,5602.00,5065.00,5056.00,5067.20,5209.60
2,N 3,20,6,1975,1461.57,1692.50,2193.82,2459.68,3246.80,4748.86,...,4344.60,2897.40,3256.40,3525.20,3070.20,3601.60,3407.40,3500.60,3437.80,3007.00
3,N 4,20,6,1975,744.54,1105.16,1417.40,1838.04,2337.62,3094.88,...,3808.64,3114.42,3847.20,4632.30,4656.00,5228.52,5656.72,5077.02,5403.40,5009.52
4,N 5,20,6,1975,4977.18,5248.00,5370.00,6184.89,7137.19,6743.00,...,5117.64,4332.90,4620.50,5488.80,5250.90,4899.20,4317.90,4007.90,4323.40,4819.40

Here we split the columns, into meta data and the actual values from each year.

In [157]:
meta_columns = ["Series", "N", "NF", "Starting Year"]
value_columns = [c for c in micro_data.columns if c not in meta_columns]
print(value_columns)

['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20']

Here we check if all the rows from the data has the same horizon of 6, same starting year, same number of observations, if yes then store it into the variables and drop those columns

In [158]:
count_horizon = (micro_data["NF"] == 6).sum()
count_observations = (micro_data["N"] == 20).sum()
count_starting_year = (micro_data["Starting Year"] == 1975).sum()
number_rows = micro_data.shape[0]
if count_horizon == number_rows and count_observations == number_rows and count_starting_year == number_rows:
    print("All the rows contain the same horizon: 6")
    print("All the rows has the same number of observations: 20")
    print("All the rows has the same startig year: 1975")
    print(f"There are {number_rows} rows in our dataset")
    horizon = 6
    observations = 20
    starting_year = 1975
    micro_data = micro_data.drop(columns=["NF", "N", "Starting Year", "Series"])

All the rows contain the same horizon: 6
All the rows has the same number of observations: 20
All the rows has the same startig year: 1975
There are 145 rows in our dataset

Now that we have defined a static year for all the rows, we are going to modify the name of the columns with real years instead of Ids

In [159]:
assert_real_years = {c: str(starting_year + int(c) - 1) for c in value_columns}

micro_data_years = micro_data.rename(columns=assert_real_years)
micro_data_years.head()

,1975,1976,1977,1978,1979,1980,1981,1982,1983,1984,1985,1986,1987,1988,1989,1990,1991,1992,1993,1994
0,940.66,1084.86,1244.98,1445.02,1683.17,2038.15,2342.52,2602.45,2927.87,3103.96,3360.27,3807.63,4387.88,4936.99,5379.75,6158.68,6876.58,7851.91,8407.84,9156.01
1,1991.05,2306.40,2604.00,2992.30,3722.08,5226.62,5989.46,5614.62,5527.00,5389.80,5384.40,3656.20,4034.80,4230.00,4793.20,5602.00,5065.00,5056.00,5067.20,5209.60
2,1461.57,1692.50,2193.82,2459.68,3246.80,4748.86,5559.46,5292.42,5029.40,4753.60,4344.60,2897.40,3256.40,3525.20,3070.20,3601.60,3407.40,3500.60,3437.80,3007.00
3,744.54,1105.16,1417.40,1838.04,2337.62,3094.88,4280.04,5070.20,3675.18,3667.38,3808.64,3114.42,3847.20,4632.30,4656.00,5228.52,5656.72,5077.02,5403.40,5009.52
4,4977.18,5248.00,5370.00,6184.89,7137.19,6743.00,7298.00,5260.29,4898.18,5392.04,5117.64,4332.90,4620.50,5488.80,5250.90,4899.20,4317.90,4007.90,4323.40,4819.40

Here we are going to split the data, there will be 20 - 6 = 14 observations from where the future model will learn patterns, and 6 observations from where the forecasted values will be tested on

In [160]:
cwd = Path.cwd().resolve()
parent = cwd.parent

out_dir = Path(parent / "data/raw")
out_dir.mkdir(parents=True, exist_ok=True)

In [161]:
year_cols = [c for c in micro_data_years.columns if c.isdigit()]

split_point = observations - horizon
train_cols = year_cols[:split_point]
test_cols = year_cols[split_point:]

train_df = micro_data_years[train_cols]
test_df = micro_data_years[test_cols]

train_df.to_csv(out_dir / "train_wide.csv", index=False)
train_df.to_csv(out_dir / "test_wide.csv", index=False)

train_df.head()

,1975,1976,1977,1978,1979,1980,1981,1982,1983,1984,1985,1986,1987,1988
0,940.66,1084.86,1244.98,1445.02,1683.17,2038.15,2342.52,2602.45,2927.87,3103.96,3360.27,3807.63,4387.88,4936.99
1,1991.05,2306.40,2604.00,2992.30,3722.08,5226.62,5989.46,5614.62,5527.00,5389.80,5384.40,3656.20,4034.80,4230.00
2,1461.57,1692.50,2193.82,2459.68,3246.80,4748.86,5559.46,5292.42,5029.40,4753.60,4344.60,2897.40,3256.40,3525.20
3,744.54,1105.16,1417.40,1838.04,2337.62,3094.88,4280.04,5070.20,3675.18,3667.38,3808.64,3114.42,3847.20,4632.30
4,4977.18,5248.00,5370.00,6184.89,7137.19,6743.00,7298.00,5260.29,4898.18,5392.04,5117.64,4332.90,4620.50,5488.80

In [162]:
test_df.head()

      1989     1990     1991     1992     1993     1994
0  5379.75  6158.68  6876.58  7851.91  8407.84  9156.01
1  4793.20  5602.00  5065.00  5056.00  5067.20  5209.60
2  3070.20  3601.60  3407.40  3500.60  3437.80  3007.00
3  4656.00  5228.52  5656.72  5077.02  5403.40  5009.52
4  5250.90  4899.20  4317.90  4007.90  4323.40  4819.40

In [163]:
training_sample = train_df.shape[0]
input_years = train_df.shape[1]
print(f"We have {training_sample} training samples, each with {input_years} data points")

We have 145 training samples, each with 14 data points